<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="3,1,32000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_4619" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3" offset="0" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_4618" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="12" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_4617" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="524" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_36" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="MVN_37" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_57" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="1044" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Multiply_84" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_102" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="1048" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/sincnet/wav_norm1d/InstanceNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/wav_norm1d/InstanceNormalization_output_0">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/sincnet/conv1d.0/Concat_2" type="Const" version="opset1">
			<data element_type="f32" shape="80, 1, 251" offset="1052" size="80320" />
			<output>
				<port id="0" precision="FP32" names="/sincnet/conv1d.0/Concat_2_output_0">
					<dim>80</dim>
					<dim>1</dim>
					<dim>251</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_55" type="Convolution" version="opset1">
			<data strides="10" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>32000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>1</dim>
					<dim>251</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Abs_114">
					<dim>3</dim>
					<dim>80</dim>
					<dim>3175</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/sincnet/Abs" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>3175</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/sincnet/Abs_output_0">
					<dim>3</dim>
					<dim>80</dim>
					<dim>3175</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/sincnet/pool1d.0/MaxPool" type="MaxPool" version="opset8">
			<data strides="3" dilations="1" pads_begin="0" pads_end="0" kernel="3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>3175</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/sincnet/pool1d.0/MaxPool_output_0">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_205" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MVN_206" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_226" type="Const" version="opset1">
			<data element_type="f32" shape="1, 80, 1" offset="81372" size="320" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_253" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_271" type="Const" version="opset1">
			<data element_type="f32" shape="1, 80, 1" offset="81692" size="320" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/sincnet/norm1d.0/InstanceNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/norm1d.0/InstanceNormalization_output_0">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_299" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="82012" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/sincnet/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/LeakyRelu_output_0">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="sincnet.conv1d.1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="60, 80, 5" offset="82016" size="96000" />
			<output>
				<port id="0" precision="FP32" names="sincnet.conv1d.1.weight">
					<dim>60</dim>
					<dim>80</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/sincnet/conv1d.1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>80</dim>
					<dim>1058</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>60</dim>
					<dim>80</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>1054</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_321" type="Const" version="opset1">
			<data element_type="f32" shape="1, 60, 1" offset="178016" size="240" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/sincnet/conv1d.1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>1054</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/conv1d.1/Conv_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>1054</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/sincnet/pool1d.1/MaxPool" type="MaxPool" version="opset8">
			<data strides="3" dilations="1" pads_begin="0" pads_end="0" kernel="3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>1054</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/sincnet/pool1d.1/MaxPool_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_350" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MVN_351" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_371" type="Const" version="opset1">
			<data element_type="f32" shape="1, 60, 1" offset="178256" size="240" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_398" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_416" type="Const" version="opset1">
			<data element_type="f32" shape="1, 60, 1" offset="178496" size="240" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/sincnet/norm1d.1/InstanceNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/norm1d.1/InstanceNormalization_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_444" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="82012" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/sincnet/LeakyRelu_1" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/LeakyRelu_1_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="sincnet.conv1d.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="60, 60, 5" offset="178736" size="72000" />
			<output>
				<port id="0" precision="FP32" names="sincnet.conv1d.2.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/sincnet/conv1d.2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>351</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>60</dim>
					<dim>60</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>347</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Reshape_466" type="Const" version="opset1">
			<data element_type="f32" shape="1, 60, 1" offset="250736" size="240" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/sincnet/conv1d.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>347</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/conv1d.2/Conv_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>347</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/sincnet/pool1d.2/MaxPool" type="MaxPool" version="opset8">
			<data strides="3" dilations="1" pads_begin="0" pads_end="0" kernel="3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>347</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/sincnet/pool1d.2/MaxPool_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_495" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MVN_496" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_516" type="Const" version="opset1">
			<data element_type="f32" shape="1, 60, 1" offset="250976" size="240" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_543" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_561" type="Const" version="opset1">
			<data element_type="f32" shape="1, 60, 1" offset="251216" size="240" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/sincnet/norm1d.2/InstanceNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/norm1d.2/InstanceNormalization_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_589" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="82012" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/sincnet/LeakyRelu_2" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/sincnet/LeakyRelu_2_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251456" size="24" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_output_0">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_598" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251480" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>60</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_output_0">
					<dim>3</dim>
					<dim>115</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251504" size="24" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_1_output_0">
					<dim>3</dim>
					<dim>115</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_607" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/lstm/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Transpose_output_0">
					<dim>115</dim>
					<dim>3</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_690" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_691" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/lstm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="2, 3, 128" offset="251552" size="3072" />
			<output>
				<port id="0" precision="FP32" names="/lstm/Constant_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_82" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Concat_847">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/lstm/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/lstm/Shape_1_output_0,/lstm/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_4366" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254624" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_613" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="254632" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="63" name="/lstm/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="onnx::Concat_283">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/lstm/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254640" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/lstm/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/lstm/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/lstm/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Expand_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_730" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Transpose_731" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/lstm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="2, 3, 128" offset="251552" size="3072" />
			<output>
				<port id="0" precision="FP32" names="/lstm/Constant_1_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_91" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Concat_848">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_4375" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254624" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_652" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="254632" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="73" name="/lstm/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="onnx::Concat_294">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/lstm/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254640" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/lstm/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/lstm/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/lstm/Expand_1" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Expand_1_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_732" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Transpose_733" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="ShapeOf_698" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_702" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="254648" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_699" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="254652" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Gather_703" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_700" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="254652" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Gather_701" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Broadcast_715" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Concat_694" type="Const" version="opset1">
			<data element_type="f32" shape="2, 512, 60" offset="254656" size="245760" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Concat_697" type="Const" version="opset1">
			<data element_type="f32" shape="2, 512, 128" offset="500416" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Concat_714" type="Const" version="opset1">
			<data element_type="f32" shape="2, 512" offset="1024704" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="LSTMSequence_774" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="128" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>60</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>115</dim>
					<dim>128</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_4444" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1028800" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/lstm/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>115</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Transpose_1_output_0">
					<dim>115</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/lstm/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1028832" size="24" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_6_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/lstm/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Reshape_output_0">
					<dim>115</dim>
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_871" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Transpose_872" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/lstm/Constant_7" type="Const" version="opset1">
			<data element_type="f32" shape="2, 3, 128" offset="251552" size="3072" />
			<output>
				<port id="0" precision="FP32" names="/lstm/Constant_7_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_106" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Concat_894">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/lstm/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/lstm/Shape_2_output_0,/lstm/Shape_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_4384" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254624" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_794" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="254632" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="101" name="/lstm/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="onnx::Concat_440">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/lstm/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254640" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/lstm/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/lstm/Concat_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/lstm/Expand_2" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Expand_2_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_911" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Transpose_912" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/lstm/Constant_8" type="Const" version="opset1">
			<data element_type="f32" shape="2, 3, 128" offset="251552" size="3072" />
			<output>
				<port id="0" precision="FP32" names="/lstm/Constant_8_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_115" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Concat_895">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_4393" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254624" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_833" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="254632" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="111" name="/lstm/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="onnx::Concat_451">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/lstm/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="254640" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/lstm/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/lstm/Concat_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/lstm/Expand_3" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Expand_3_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_913" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Transpose_914" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="ShapeOf_879" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_883" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="254648" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_880" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="254652" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Gather_884" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_881" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="254652" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Gather_882" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Broadcast_896" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Concat_875" type="Const" version="opset1">
			<data element_type="f32" shape="2, 512, 256" offset="1028856" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Concat_878" type="Const" version="opset1">
			<data element_type="f32" shape="2, 512, 128" offset="2077432" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Concat_895" type="Const" version="opset1">
			<data element_type="f32" shape="2, 512" offset="2601720" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="LSTMSequence_955" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="128" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>115</dim>
					<dim>128</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_4446" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1028800" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/lstm/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
					<dim>115</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Transpose_2_output_0">
					<dim>115</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="/lstm/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1028832" size="24" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_13_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/lstm/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Reshape_1_output_0">
					<dim>115</dim>
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Constant_1052" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="251528" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Transpose_1053" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>115</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="/lstm/Constant_14" type="Const" version="opset1">
			<data element_type="f32" shape="2, 3, 128" offset="251552" size="3072" />
			<output>
				<port id="0" precision="FP32" names="/lstm/Constant_14_output_0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Constant_130" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1036" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Concat_941">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="/lstm/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>115</dim>
					<dim>3</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/lstm/Shape_4_output_0,/lstm/Shape_5_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
